// 문제 설명
// 자연수 n 개로 이루어진 중복 집합(multi set, 편의상 이후에는 "집합"으로 통칭) 중에 다음 두 조건을 만족하는 집합을 최고의 집합이라고 합니다.
//  1. 각 원소의 합이 S가 되는 수의 집합
//  2. 위 조건을 만족하면서 각 원소의 곱 이 최대가 되는 집합
// 예를 들어서 자연수 2개로 이루어진 집합 중 합이 9가 되는 집합은 다음과 같이 4개가 있습니다.
// { 1, 8 }, { 2, 7 }, { 3, 6 }, { 4, 5 }
// 그중 각 원소의 곱이 최대인 { 4, 5 }가 최고의 집합입니다.
// 집합의 원소의 개수 n과 모든 원소들의 합 s가 매개변수로 주어질 때, 최고의 집합을 return 하는 solution 함수를 완성해주세요.

// 제한사항
// 최고의 집합은 오름차순으로 정렬된 1차원 배열(list, vector) 로 return 해주세요.
// 만약 최고의 집합이 존재하지 않는 경우에 크기가 1인 1차원 배열(list, vector) 에 -1 을 채워서 return 해주세요.
// 자연수의 개수 n은 1 이상 10,000 이하의 자연수입니다.
// 모든 원소들의 합 s는 1 이상, 100,000,000 이하의 자연수입니다.

// 입출력 예
// n	s	result
// 2	9	[4, 5]
// 2	1	[-1]
// 2	8	[4, 4]

function solution(n, s) {
  if (s / n < 1) return [-1];

  const avg = Math.floor(s / n);
  const answer = Array.from({ length: n }, () => avg);
  const hab = answer.reduce((acc, cur) => acc + cur, 0);

  let idx = answer.length - 1;
  let rst = s - hab;

  while (rst > 0) {
    answer[idx]++;
    idx--;
    rst--;
  }

  return answer;
}

// 문제는 단순하다. 각 값이 균등하게 나눠졌을 때, 각 요소의 곱이 최대가 되므로
// 우선 s/n 을 계산하여 반내림한다. 해당 값을 n번 더하여 hab을 만든 뒤,
// hab이 s보다 적다면 배열의 뒷 요소부터 값을 더한다.
// 나머지 값(rst)가 n을 넘을 수 없다는 사실을 기억해두자.
